'''
题日描述
给定两个IP地址和一个子网掩码,如果两个地址跟子网掩码二进制按位与之后的结果相同,则
认为两个P地址属于同一个网段
例如1921681.1(110000001010100000000010000001)与子网掩码
255255255240(11111111000进制按位与之后为
2.168.1.0(110000001010100000000001000000
现给走两个地址和一个子网掩码,判断是否2个P地址是否是一个网段。并按照要求输出第一
P地址与子网掩码二进制按位与之后的P
输入描述
输入的格式:玊地址1IE地址2子网掩码,三个字段之间用空格分隔。给定的工地址和子网
掩码一定是合法的
输出描述
0或者1第一个I地址与子网掩码二进制按位与之后的工F
0代表不是同一个网段,1代表是同一个网段
例1
输入
192.168.1.1  192.168.1.2  255.255.255.0
输出
1 192.168.1.0
例2
输入
192.168.1.1  192.168.2.1 255.255.255.0
输出
0  192.168.1.0
'''

ip1='192.168.1.1'.split('.')
ip2='192.168.1.2'.split('.')
mask_ip='255.255.255.0'.split('.')

new_ip1=[]
new_ip2=[]

for i in range(len(ip1)):
    new_ip1.append(str(int(ip1[i])&int(mask_ip[i])))
    new_ip2.append(str(int(ip2[i])&int(mask_ip[i])))

print(new_ip2)
print(new_ip1)

res = 0
if new_ip1==new_ip2:
    res=1
    print(res,'.'.join(new_ip1))
else:
    print(res, '.'.join(new_ip1))








